In [2]:
import pandas as pd
data ={
    'Location':['New York', 'new york', 'NEW YORK', 'New york', 'new York']
}
df = pd.DataFrame(data)

In [4]:
df

   Location
0  New York
1  new york
2  NEW YORK
3  New york
4  new York

In [5]:
df['Location'].unique()

array(['New York', 'new york', 'NEW YORK', 'New york', 'new York'],
      dtype=object)

In [7]:
df['Location']=df['Location'].str.strip().str.title()

In [8]:
df

   Location
0  New York
1  New York
2  New York
3  New York
4  New York

In [9]:
df['Location'].unique()

array(['New York'], dtype=object)